<?php

return [
    'admins'            => [
        'create'    => [
            'form'  => [
                'confirm_password'  => 'تاكيد كلمة المرور',
                'email'             => 'البريد الالكتروني',
                'general'           => 'بيانات عامة',
                'image'             => 'الصورة الشخصية',
                'info'              => 'البيانات',
                'mobile'            => 'الهاتف',
                'name'              => 'الاسم',
                'password'          => 'كلمة المرور',
                'roles'             => 'الادوار',
            ],
            'title' => 'اضافة المدراء',
        ],
        'datatable' => [
            'created_at'    => 'تاريخ الآنشاء',
            'date_range'    => 'البحث بالتواريخ',
            'email'         => 'البريد الالكتروني',
            'image'         => 'الصورة الشخصية',
            'mobile'        => 'الهاتف',
            'name'          => 'الاسم',
            'options'       => 'الخيارات',
        ],
        'index'     => [
            'title' => 'المدراء',
        ],
        'update'    => [
            'form'  => [
                'confirm_password'  => 'تآكيد كلمة المرور',
                'email'             => 'البريد الالكتروني',
                'general'           => 'بيانات عامة',
                'image'             => 'الصورة الشخصية',
                'mobile'            => 'الهاتف',
                'name'              => 'الاسم',
                'password'          => 'تغير كلمة المرور',
                'roles'             => 'الادوار',
            ],
            'title' => 'تعديل المدراء',
        ],
        'validation'=> [
            'email'     => [
                'required'  => 'من فضلك ادخل البريد الالكتروني',
                'unique'    => 'هذا البريد تم ادخالة من قبل',
            ],
            'mobile'    => [
                'digits_between'    => 'من فضلك ادخل ٨ ارقام فقط داخل رقم الهاتف',
                'numeric'           => 'يجب ان يتكون رقم الهاتف من ارقام فقط بالانجليزية',
                'required'          => 'من فضلك ادخل رقم الهاتف',
                'unique'            => 'رقم الهاتف تم ادخالة من قبل',
            ],
            'name'      => [
                'required'  => 'من فضلك ادخل الاسم الشخصي',
            ],
            'password'  => [
                'min'       => 'يجب ان يتكون كلمة المرور من كلمة اكبر من ٦ مدخلات : ارقام او احرف',
                'required'  => 'من فضلك ادخل كلمة المرور',
                'same'      => 'كلمة المرور غير متطابقة مع التآكيد',
            ],
            'roles'     => [
                'required'  => 'من فضلك اختر ادوار المدير',
            ],
        ],
    ],
    'users'             => [
        'form'  => [
            'confirm_password'  => 'تاكيد كلمة المرور',
            'email'             => 'البريد الالكتروني',
            'general'           => 'بيانات عامة',
            'image'             => 'الصورة الشخصية',
            'info'              => 'البيانات',
            'mobile'            => 'الهاتف',
            'name'              => 'الاسم',
            'password'          => 'كلمة المرور',
            "country_id"          => "البلد",
            "admin_approved"    => "توثيق",
            "is_verified"       => "تاكيد الجوال",
            
        ],
        'create'    => [
          
            'title' => 'اضافة مستخدم',
        ],
        'datatable' => [
            'created_at'    => 'تاريخ الآنشاء',
            'date_range'    => 'البحث بالتواريخ',
            'email'         => 'البريد الالكتروني',
            'image'         => 'الصورة الشخصية',
            'mobile'        => 'الهاتف',
            "parents"       => "الاب",
            "admin_approved"=> "التوثيق من قبل الاداره",
            "id_number"     => "رقم البطاقة المدنيه",
            'name'          => 'الاسم',
            "status"          => "الحاله",
            'options'       => 'الخيارات',
        ],
        'index'     => [
            'title' => 'المستخدمين',
        ],
        'update'    => [
            'title' => 'تعديل مستخدم',
        ],
        "show" => [
          "title" => "عرض المستخدم",
          "subscriptions"=> [
            "current"  => "الاشتراك الحالى"  ,
            "package_id"  => "الباقه",
            "start_at" => "تاريخ البدايه",
            "end_at"   => "تاريخ النهايه" ,
            "from_admin"=> "تم الاضافه من قبل الادمن",
            "transtions_id" => "عملية الدفع",
            "price"         => "السعر" ,
            "add"           => "اضافة باقة جديد"
          ],
          "tabs"  => [
            'general'           => 'بيانات عامة',
            "subscriptions"     => "الاشتراكات",
          ],
        ],
        'validation'=> [
            'email'     => [
                'required'  => 'من فضلك ادخل البريد الالكتروني',
                'unique'    => 'هذا البريد تم ادخالة من قبل',
            ],
            'mobile'    => [
                'digits_between'    => 'من فضلك ادخل ٨ ارقام فقط داخل رقم الهاتف',
                'numeric'           => 'يجب ان يتكون رقم الهاتف من ارقام فقط بالانجليزية',
                'required'          => 'من فضلك ادخل رقم الهاتف',
                'unique'            => 'رقم الهاتف تم ادخالة من قبل',
            ],
            'name'      => [
                'required'  => 'من فضلك ادخل الاسم الشخصي',
            ],
            'password'  => [
                'min'       => 'يجب ان يتكون كلمة المرور من كلمة اكبر من ٦ مدخلات : ارقام او احرف',
                'required'  => 'من فضلك ادخل كلمة المرور',
                'same'      => 'كلمة المرور غير متطابقة مع التآكيد',
            ],
        ],
    ],
    'workers'             => [
        'form'  => [
            'confirm_password'  => 'تاكيد كلمة المرور',
            'email'             => 'البريد الالكتروني',
            'general'           => 'بيانات عامة',
            'image'             => 'الصورة الشخصية',
            'info'              => 'البيانات',
            'mobile'            => 'الهاتف',
            'name'              => 'الاسم',
            'password'          => 'كلمة المرور',
            "country_id"          => "البلد",
            "admin_approved"    => "توثيق",
            "is_verified"       => "تاكيد الجوال",
            "roles"             => "الصالحيات",
            "type"              => "النوع" ,
            "types"             => [
                "influencer_worker" => "موظف مشهور" ,
                "company_worker"    => "موظف الشركه"
            ]
            
        ],
        'create'    => [
          
            'title' => 'اضافة موظف',
        ],
        'datatable' => [
            'created_at'    => 'تاريخ الآنشاء',
            'date_range'    => 'البحث بالتواريخ',
            'email'         => 'البريد الالكتروني',
            'image'         => 'الصورة الشخصية',
            'mobile'        => 'الهاتف',
            "type"              => "النوع" ,

            "parents"       => "الاب",
            "admin_approved"=> "التوثيق من قبل الاداره",
            "id_number"     => "رقم البطاقة المدنيه",
            'name'          => 'الاسم',
            "status"          => "الحاله",
            'options'       => 'الخيارات',
        ],
        'index'     => [
            'title' => 'الموظفين',
        ],
        'update'    => [
            'title' => 'تعديل موظف',
        ],
        "show" => [
          "title" => "عرض موظف",
          "tabs"  => [
            'general'           => 'بيانات عامة',
          ],
        ],
       
    ]
];
