<?php

return [
    'login' => [
        'form'          => [
            'btn'       => [
                'login' => 'تسجيل الدخول',
            ],
            'name'     => 'الإسم',
            'email'     => 'البريد الالكتروني',
            'mobile'     => 'رقم الهاتف',
            'password'  => 'كلمة المرور',
            'confirm_password'=> 'تأكيد كلمة المرور',
            'dont_have_acccount'=> "ليس لديك حساب ؟",
            'create_free_account'=> "إنشاء حساب مجانا .",
            'by_creating_this_account'=> "من خلال إنشاء هذا الحساب ، فإنك تقبل",
            'privacy_policy'=> "سياسة الخصوصية الخاصة بنا",
            'have_account'=> "لديك حساب بالفعل؟",
            'sign_in'=> "تسجيل الدخول",
            'create_account'=> "إنشاء حساب",

        ],
        'routes'        => [
            'index' => 'تسجيل الدخول',
        ],
        'validations'   => [
            'email'     => [
                'email'     => 'من فضلك ادخل البريد بشكل صحيح',
                'required'  => 'من فضلك ادخل البريد الالكتروني',
            ],
            'failed'    => 'هذه البيانات غير متطابقة لدينا من فضلك تآكد من بيانات تسجيل الدخول',
            'password'  => [
                'min'       => 'كلمة المرور يجب ان تكون اكثر من ٦ مدخلات',
                'required'  => 'يجب ان تدخل كلمة المرور',
            ],
        ],
    ],
];
